In [1]:
import numpy as np 
import pandas as pd
from sklearn.preprocessing import MinMaxScaler
from sklearn.model_selection import train_test_split

In [2]:
df = pd.read_csv('http://bit.ly/drinksbycountry')

In [3]:
df.sample(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
162,Sudan,8,13,0,1.7,Africa
23,Brazil,245,145,16,7.2,South America
6,Argentina,193,25,221,8.3,South America
107,Mauritania,0,0,0,0.0,Africa
96,Liberia,19,152,2,3.1,Africa

In [4]:
rdf = df[['beer_servings','total_litres_of_pure_alcohol','continent']]
rdf.head()

   beer_servings  total_litres_of_pure_alcohol continent
0              0                           0.0      Asia
1             89                           4.9    Europe
2             25                           0.7    Africa
3            245                          12.4    Europe
4            217                           5.9    Africa

In [5]:
X = rdf.drop('continent',axis=1)
Y = rdf.continent

In [6]:
X_train ,X_test ,Y_train ,Y_test = train_test_split(X,Y,test_size=0.2,random_state=0)

In [7]:
minmax = MinMaxScaler()
minmax.fit(X_train)

MinMaxScaler()

In [8]:
# now we transform both test and train set but we only fit on training set
X_test_transformed = minmax.transform(X_test)
X_train_transformed = minmax.transform(X_train)

In [9]:
X_train_transformed = pd.DataFrame(X_train_transformed,columns=X_train.columns)
X_test_transformed = pd.DataFrame(X_test_transformed,columns=X_test.columns)

In [10]:
X_train_transformed.head()

   beer_servings  total_litres_of_pure_alcohol
0       0.002660                      0.062500
1       0.694149                      0.722222
2       0.002660                      0.006944
3       0.912234                      0.756944
4       0.117021                      0.104167

In [11]:
X_test_transformed.head()

   beer_servings  total_litres_of_pure_alcohol
0       0.000000                      0.000000
1       0.188830                      0.319444
2       0.510638                      0.569444
3       0.007979                      0.006944
4       0.000000                      0.000000

In [13]:
X_train.describe()

       beer_servings  total_litres_of_pure_alcohol
count     154.000000                    154.000000
mean      110.610390                      4.849351
std       101.431023                      3.850070
min         0.000000                      0.000000
25%        21.000000                      1.300000
50%        77.500000                      4.300000
75%       193.750000                      7.675000
max       376.000000                     14.400000

In [12]:
np.round(X_train.describe(),1)

       beer_servings  total_litres_of_pure_alcohol
count          154.0                         154.0
mean           110.6                           4.8
std            101.4                           3.9
min              0.0                           0.0
25%             21.0                           1.3
50%             77.5                           4.3
75%            193.8                           7.7
max            376.0                          14.4

# Robust Scaling

Formula = X-X.median/(Inter Quatile Range)

In [ ]:
# we do this when there are more number of outliers